1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

2. Import the dataset from this [link](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user). Assign it to a variable called users and use the 'user_id' as index

In [6]:
url = "https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user"
users = pd.read_csv(url,sep='|', index_col=0)

3. See the first 25 entries

In [7]:
users.head(25)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

4. See the last 10 entries

In [8]:
users.tail(10)

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

5. What is the number of observations in the dataset?

In [9]:
users.shape[0]

943

6. What is the number of columns in the dataset?

In [10]:
print(users.shape[1])
print(len(users.columns))

4
4

7.  Print the name of all the columns.

In [11]:
users.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

8. How is the dataset indexed?

In [13]:
users.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

In [18]:
#Extra code block
x = pd.DataFrame({'a':[1],'b':[2]})
y = pd.DataFrame({'b':[10],'c':[11]})
z = pd.concat([x, y])
print(z)

     a   b     c
0  1.0   2   NaN
0  NaN  10  11.0

9. What is the data type of each column?

In [54]:
users.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

10. Print only the occupation column

In [20]:
users['occupation']

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

11. How many different occupations are in this dataset?

In [55]:
#correct answer
users['occupation'].nunique()

21

In [56]:
#alternatively
users['occupation'].value_counts().count()

21

12. What is the most frequent occupation?

In [58]:
fc = users['occupation'].value_counts()
print(fc.head(1))
print(fc.head(1).index[0])

student    196
Name: occupation, dtype: int64
student

13.Summarize the DataFrame.

In [40]:
users.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

14. Summarize all the columns

In [60]:
users.describe(include="all")

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

15. Summarize only the occupation column

In [42]:
users['occupation'].describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

16.  What is the mean age of users?

In [64]:
mean_age = users['age'].describe()
#print(mean_age)
print(mean_age.head(2))

count    943.000000
mean      34.051962
Name: age, dtype: float64

In [66]:
#alternatively
round(users['age'].mean())

34

17. What is the age with least occurrence?

In [52]:
least_age = users['age'].value_counts()
least_age.tail(5)

11    1
10    1
73    1
66    1
7     1
Name: age, dtype: int64